Revit 2026 API

# RevitAPIPreDocEventArgs Properties

---

The RevitAPIPreDocEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | Document | The document associated with the event. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |

#### Reference

RevitAPIPreDocEventArgs Class

Autodesk.Revit.DB.Events Namespace